GetLinePattern Method
 Gets the LinePattern associated to this element.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2012
 Syntax
  C#
public LinePattern GetLinePattern()
  Visual Basic
Public Function GetLinePattern As LinePattern
  Visual C++
public:
LinePattern^ GetLinePattern()
 Return Value
 A copy of LinePattern object.
 See Also
  LinePatternElement Class
  GetLinePattern Overload
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →